public class LessonOneProgramOne {
    /**
     * 3. Написать программу для вывода сообещния "Hello, team"
     */


    public static void main(String[] args) {
        System.out.println("Hello, team");
    }
}
